In [1]:
import pandas as pd
from typing import List

# 1.Write a solution to create a DataFrame from a 2D list called student_data. This 2D list contains the IDs and ages of some students.

The DataFrame should have two columns, student_id and age, and be in the same order as the original 2D list.

In [2]:
def createDataframe(student_data: List[List[int]]) -> pd.DataFrame:
    df=pd.DataFrame(student_data, columns=['student_id', 'age'])
    return df

In [3]:
student_data=[
  [1, 15],
  [2, 11],
  [3, 11],
  [4, 20]
]
student=createDataframe(student_data)
student

   student_id  age
0           1   15
1           2   11
2           3   11
3           4   20

# 2. Write a solution to calculate and display the number of rows and columns of players.

Return the result as an array:

[number of rows, number of columns]

In [4]:
def getDataframeSize(student: pd.DataFrame) -> List[int]:
    return list(student.shape)

In [5]:
getDataframeSize(student)

[4, 2]

# 3. Write a solution to display the first 3 rows of this DataFrame.

In [6]:
data = [
    [3, "Bob", "Operations", 48675],
    [90, "Alice", "Sales", 11096],
    [9, "Tatiana", "Engineering", 33805],
    [60, "Annabelle", "InformationTechnology", 37678],
    [49, "Jonathan", "HumanResources", 23793],
    [43, "Khaled", "Administration", 40454]
]

df = pd.DataFrame(data, columns=["employee_id", "name", "department", "salary"])

In [7]:
def selectFirstRows(employees: pd.DataFrame) -> pd.DataFrame:
    return employees.head(3)
selectFirstRows(df)

   employee_id     name   department  salary
0            3      Bob   Operations   48675
1           90    Alice        Sales   11096
2            9  Tatiana  Engineering   33805

# 4. Write a solution to select the name and age of the student with student_id = 101.

In [8]:
studict={'student_id':[101,53,128,3],'name':['Ulysses','William','Henry','Henry'],'age':[13,10,6,11]}
student_df=pd.DataFrame(studict)

In [9]:
def selectData(students: pd.DataFrame) -> pd.DataFrame:
    return(students[students['student_id']==101][['name','age']])

In [10]:
selectData(student_df)

      name  age
0  Ulysses   13

# 5. A company plans to provide its employees with a bonus.

Write a solution to create a new column name bonus that contains the doubled values of the salary column.

In [11]:
names = pd.Series(["Piper", "Grace", "Georgia", "Willow", "Finn", "Thomas"])
salaries = pd.Series([4548, 28150, 1103, 6593, 74576, 24433])

employees = pd.DataFrame({
    "name": names,
    "salary": salaries
})
employees

      name  salary
0    Piper    4548
1    Grace   28150
2  Georgia    1103
3   Willow    6593
4     Finn   74576
5   Thomas   24433

In [12]:
def createBonusColumn(employees: pd.DataFrame) -> pd.DataFrame:
    employees['bonus']=2*employees['salary']
    return(employees)

In [13]:
createBonusColumn(employees)

      name  salary   bonus
0    Piper    4548    9096
1    Grace   28150   56300
2  Georgia    1103    2206
3   Willow    6593   13186
4     Finn   74576  149152
5   Thomas   24433   48866

# 6. There are some duplicate rows in the DataFrame based on the email column.

Write a solution to remove these duplicate rows and keep only the first occurrence.

In [14]:
data = [
    {"customer_id": 1, "name": "Ella", "email": "emily@example.com"},
    {"customer_id": 2, "name": "David", "email": "michael@example.com"},
    {"customer_id": 3, "name": "Zachary", "email": "sarah@example.com"},
    {"customer_id": 4, "name": "Alice", "email": "john@example.com"},
    {"customer_id": 5, "name": "Finn", "email": "john@example.com"},
    {"customer_id": 6, "name": "Violet", "email": "alice@example.com"}
]

df = pd.DataFrame(data)
df

   customer_id     name                email
0            1     Ella    emily@example.com
1            2    David  michael@example.com
2            3  Zachary    sarah@example.com
3            4    Alice     john@example.com
4            5     Finn     john@example.com
5            6   Violet    alice@example.com

In [15]:
def dropDuplicateEmails(customers: pd.DataFrame) -> pd.DataFrame:
    return(customers.drop_duplicates(subset='email',keep='first'))

In [16]:
dropDuplicateEmails(df)

   customer_id     name                email
0            1     Ella    emily@example.com
1            2    David  michael@example.com
2            3  Zachary    sarah@example.com
3            4    Alice     john@example.com
5            6   Violet    alice@example.com

# 7. There are some rows having missing values in the name column.

Write a solution to remove the rows with missing values.

In [17]:
data = [
    [32, "Piper", 5],
    [217, None, 19],
    [779, "Georgia", 20],
    [849, "Willow", 14]
]

df = pd.DataFrame(data, columns=["student_id", "name", "age"])
print(df)

   student_id     name  age
0          32    Piper    5
1         217     None   19
2         779  Georgia   20
3         849   Willow   14

In [18]:
def dropMissingData(students: pd.DataFrame) -> pd.DataFrame:
    return(students.dropna(subset='name'))

In [19]:
dropMissingData(df)

   student_id     name  age
0          32    Piper    5
2         779  Georgia   20
3         849   Willow   14

# 8. A company intends to give its employees a pay rise.

Write a solution to modify the salary column by multiplying each salary by 2.

In [20]:
names = pd.Series(["Piper", "Grace", "Georgia", "Willow", "Finn", "Thomas"])
salaries = pd.Series([4548, 28150, 1103, 6593, 74576, 24433])

employees = pd.DataFrame({
    "name": names,
    "salary": salaries
})
employees

      name  salary
0    Piper    4548
1    Grace   28150
2  Georgia    1103
3   Willow    6593
4     Finn   74576
5   Thomas   24433

In [21]:
def modifySalaryColumn(employees: pd.DataFrame) -> pd.DataFrame:
    employees['salary']=employees['salary']*2
    return employees

In [22]:
modifySalaryColumn(employees)

      name  salary
0    Piper    9096
1    Grace   56300
2  Georgia    2206
3   Willow   13186
4     Finn  149152
5   Thomas   48866

# 9. Write a solution to rename the columns as follows:

id to student_id,
first to first_name,
last to last_name,
age to age_in_years,

In [23]:
data = [
    [1, "Mason", "King", 6],
    [2, "Ava", "Wright", 7],
    [3, "Taylor", "Hall", 16],
    [4, "Georgia", "Thompson", 18],
    [5, "Thomas", "Moore", 10]
]

df = pd.DataFrame(data, columns=["id", "first", "last", "age"])
print(df)

   id    first      last  age
0   1    Mason      King    6
1   2      Ava    Wright    7
2   3   Taylor      Hall   16
3   4  Georgia  Thompson   18
4   5   Thomas     Moore   10

In [24]:
def renameColumns(students: pd.DataFrame) -> pd.DataFrame:
    return(students.rename(columns={'id':'student_id','first':'first_name','last':'last_name','age':'age_in_years'}))

In [25]:
renameColumns(df)

   student_id first_name last_name  age_in_years
0           1      Mason      King             6
1           2        Ava    Wright             7
2           3     Taylor      Hall            16
3           4    Georgia  Thompson            18
4           5     Thomas     Moore            10

# 10. The grade column is stored as floats, convert it to integers.

In [26]:
data = [
    [1, "Ava", 6, 73.0],
    [2, "Kate", 15, 87.0]
]

df = pd.DataFrame(data, columns=["student_id", "name", "age", "grade"])
df

   student_id  name  age  grade
0           1   Ava    6   73.0
1           2  Kate   15   87.0

In [27]:
def changeDatatype(students: pd.DataFrame) -> pd.DataFrame:
    students['grade']=students['grade'].astype('int')
    return students

In [28]:
changeDatatype(df)

   student_id  name  age  grade
0           1   Ava    6     73
1           2  Kate   15     87

# 11.Write a solution to fill in the missing value as 0 in the quantity column

In [29]:
data = [
    ["Wristwatch", None, 135],
    ["WirelessEarbuds", None, 821],
    ["GolfClubs", 779, 9319],
    ["Printer", 849, 3051]
]

df = pd.DataFrame(data, columns=["name", "quantity", "price"])
df

              name  quantity  price
0       Wristwatch       NaN    135
1  WirelessEarbuds       NaN    821
2        GolfClubs     779.0   9319
3          Printer     849.0   3051

In [30]:
def fillMissingValues(products: pd.DataFrame) -> pd.DataFrame:
    products['quantity'].fillna(0,inplace=True)
    return products

In [31]:
fillMissingValues(df)

              name  quantity  price
0       Wristwatch       0.0    135
1  WirelessEarbuds       0.0    821
2        GolfClubs     779.0   9319
3          Printer     849.0   3051

# 12 Write a solution to concatenate these two DataFrames vertically into one DataFrame

In [32]:
data1 = [
    [1, "Mason", 8],
    [2, "Ava", 6],
    [3, "Taylor", 15],
    [4, "Georgia", 17]
]
data2 = [
    [5, "Leo", 7],
    [6, "Alex", 7]
]

df1 = pd.DataFrame(data1, columns=["student_id", "name", "age"])

df2 = pd.DataFrame(data2, columns=["student_id", "name", "age"])

In [33]:
def concatenateTables(df1: pd.DataFrame, df2: pd.DataFrame) -> pd.DataFrame:
    new_df=pd.concat([df1,df2],axis=0)
    return(new_df)

In [34]:
concatenateTables(df1,df2)

   student_id     name  age
0           1    Mason    8
1           2      Ava    6
2           3   Taylor   15
3           4  Georgia   17
0           5      Leo    7
1           6     Alex    7

# 13. Write a solution to pivot the data so that each row represents temperatures for a specific month, and each city is a separate column.

In [35]:
data = [
    ["Jacksonville", "January", 13],
    ["Jacksonville", "February", 23],
    ["Jacksonville", "March", 38],
    ["Jacksonville", "April", 5],
    ["Jacksonville", "May", 34],
    ["ElPaso", "January", 20],
    ["ElPaso", "February", 6],
    ["ElPaso", "March", 26],
    ["ElPaso", "April", 2],
    ["ElPaso", "May", 43]
]
df = pd.DataFrame(data, columns=["city", "month", "temperature"])
df

           city     month  temperature
0  Jacksonville   January           13
1  Jacksonville  February           23
2  Jacksonville     March           38
3  Jacksonville     April            5
4  Jacksonville       May           34
5        ElPaso   January           20
6        ElPaso  February            6
7        ElPaso     March           26
8        ElPaso     April            2
9        ElPaso       May           43

In [36]:
def pivotTable(weather: pd.DataFrame) -> pd.DataFrame:
    pvt=pd.pivot_table(index='month',columns='city',values='temperature',data=weather)
    return(pvt)

In [37]:
pivotTable(df)

city      ElPaso  Jacksonville
month
April          2             5
February       6            23
January       20            13
March         26            38
May           43            34

# 14. Write a solution to reshape the data so that each row represents sales data for a product in a specific quarter.

In [38]:
data = [
    ["Umbrella", 417, 224, 379, 611],
    ["SleepingBag", 800, 936, 93, 875]
]

df = pd.DataFrame(data, columns=["product", "quarter_1", "quarter_2", "quarter_3", "quarter_4"])
df

       product  quarter_1  quarter_2  quarter_3  quarter_4
0     Umbrella        417        224        379        611
1  SleepingBag        800        936         93        875

In [39]:
def meltTable(report: pd.DataFrame) -> pd.DataFrame:
    return(pd.melt(report,id_vars='product',value_vars=['quarter_1','quarter_2','quarter_3','quarter_4'],var_name='quarter',value_name='sales'))

In [40]:
meltTable(df)

       product    quarter  sales
0     Umbrella  quarter_1    417
1  SleepingBag  quarter_1    800
2     Umbrella  quarter_2    224
3  SleepingBag  quarter_2    936
4     Umbrella  quarter_3    379
5  SleepingBag  quarter_3     93
6     Umbrella  quarter_4    611
7  SleepingBag  quarter_4    875

# 15. Write a solution to list the names of animals that weigh strictly more than 100 kilograms.

Return the animals sorted by weight in descending order.

In [41]:
data = [
    ["Tatiana", "Snake", 98, 464],
    ["Khaled", "Giraffe", 50, 41],
    ["Alex", "Leopard", 6, 328],
    ["Jonathan", "Monkey", 45, 463],
    ["Stefan", "Bear", 100, 50],
    ["Tommy", "Panda", 26, 349]
]

df = pd.DataFrame(data, columns=["name", "species", "age", "weight"])
df

       name  species  age  weight
0   Tatiana    Snake   98     464
1    Khaled  Giraffe   50      41
2      Alex  Leopard    6     328
3  Jonathan   Monkey   45     463
4    Stefan     Bear  100      50
5     Tommy    Panda   26     349

In [42]:
def findHeavyAnimals(animals: pd.DataFrame) -> pd.DataFrame:
    return(animals[animals['weight']>100].sort_values(by='weight',ascending=False)[['name']])

In [43]:
findHeavyAnimals(df)

       name
0   Tatiana
3  Jonathan
5     Tommy
2      Alex